<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;

class PermissionTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {

        $permissions = [
            //مقالات
            'مقالات-عرض',
            'مقالات-انشاء',
            'مقالات-تعديل',
            'مقالات-حذف',
            //وصفات
            'وصفات-عرض',
            'وصفات-انشاء',
            'وصفات-تعديل',
            'وصفات-حذف',
            //اقسام
            'أقسام-عرض',
            'أقسام-انشاء',
            'أقسام-تعديل',
            'أقسام-حذف',

            //وسوم
            'وسوم-عرض',
            'وسوم-انشاء',
            'وسوم-تعديل',
            'وسوم-حذف',

            //  اسئلة شائعة
            'اسئلة شائعة-عرض',
            'اسئلة شائعة-انشاء',
            'اسئلة شائعة-تعديل',
            'اسئلة شائعة-حذف',
            //حاسبة السعرات الغذائية
            'حاسبة الوجبات -عرض',
            'حاسبة الوجبات -رؤيا',
            'حاسبة الوجبات -انشاء',
            'حاسبة الوجبات -تعديل',
            'حاسبة الوجبات -حذف',

            //اشتراك
            'اشتراك-عرض',
            'اشتراك-رؤيا',
            'اشتراك-انشاء',
            'اشتراك-تعديل',
            'اشتراك-حذف',
            //محتويات الاشتراك
            'محتويات الاشتراك-عرض',
            'محتويات الاشتراك-انشاء',
            'محتويات الاشتراك-تعديل',
            'محتويات الاشتراك-حذف',

            //اشتراك مستخدمين
            'subscribe-users-index',

            //صلاحيات
            'صلاحيات-عرض',
            'صلاحيات-رؤيا',
            'صلاحيات-انشاء',
            'صلاحيات-تعديل',
            'صلاحيات-حذف',
            // مشرفين
            'مشرفين-عرض',
            'مشرفين-انشاء',
            'مشرفين-تعديل',
            'مشرفين-حذف',
            //صفحات الثابتة
            'صفحات الثابتة-عرض',
            'صفحات الثابتة-انشاء',
            'صفحات الثابتة-رؤيا',
            'صفحات الثابتة-تعديل',
            'صفحات الثابتة-حذف',
            // أطباء
            'أطباء-عرض',
            'أطباء-انشاء',
            'أطباء-تعديل',
            'أطباء-حذف',
            'أطباء-عرض مواعيد',



            //مستخدمين
            'users-index',
            'users-profile',
            'users-show-profile',
            'users-edit',
            'users-delete',


            //خدمات الموقع
            'خدمات الموقع-عرض',
            'خدمات الموقع-انشاء',
            'خدمات الموقع-تعديل',
            'خدمات الموقع-حذف',
            //موعد الطبيب
            'موعد الطبيب-عرض',
            'موعد الطبيب-انشاء',
            'موعد الطبيب-تعديل',
            'موعد الطبيب-حذف',

            //حجوزات المستخدمين
            "users-booking",


            //تقييم المتسخدمين
            "ratting-users",
            "ratting-users-delete",
            //تقييم الاطباء
            "ratting-docotors",
            "ratting-docotors-delete",
            //تقييم حجوزات
            "ratting-subscribes",
            "ratting-subscribes-delete",

            //طلبات التواصل
            "طلبات التواصل",
            "طلبات التواصل-عرض",
            "طلبات التواصل-حذف",

            //اعدادات الموقع
            "اعدادات الموقع",
            "اعدادات الموقع-تعديل",
            //chat
            "chat",
        ];

        foreach ($permissions as $permission) {
            Permission::create(['name' => $permission, 'guard_name' => 'admin']);
        }
    }
}
